       IDENTIFICATION DIVISION.
       PROGRAM-ID. VALIDADORCLIENTE.
       AUTHOR. GUILHERME PACHECO.
       INSTALLATION. SANSUNG NOTEBOOK.
       DATE-WRITTEN. 22/01/2025.
       DATE-COMPILED. 22/01/2025.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           
           STOP RUN.
        
