       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'TABUADA'.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.